#+TITLE: The Islands Design Manual
#+STARTUP: indent

* The Main Event Loop
[[file:demo_test.py::__author__%20=%20'millejoh'][demo_test.py]] is an early demonstration of using my Python port of dormouse to
create an application. What is missing:

 1. Truly responding to events (both mouse keyboard).
 2. Update loops for animation/ai/world state (do all these need to be distinct?).
 3. More sophisticated UI - i.e. screen partitioning and windows for messages/information.
 4. Integration with IPython.

Lets focus on #4 and build a sample application that integrates with IPython.
Or, screw integrating with IPython - let's just put the main loop on a thread!
Later we can think about using true multiprocessing.

#+NAME: 17150a98-5a72-4bbb-a10f-e74261c71c0e
#+BEGIN_SRC ein-python :session http://localhost:8888/Islands_tcod.ipynb :results drawer
  import tcod
  import tcod.event
  from gui.managers import GUIEventLoop, WindowManager
  from gui.window import Window, ListWindow
  from threading import Thread
  import logging
  import time
  import sys

  # logging.basicConfig(level=logging.DEBUG, stream=sys.stdout)
  logging.basicConfig(stream=sys.stdout)

  class DemoGuiGame(GUIEventLoop):
      def initialize(self):
          self.w1 = Window(5, 5, 15, 15, title='Window 1', framed=True, window_manager=self.window_manager)
          self.w2 = Window(10, 10, 20, 30, title='Window 2', framed=True, window_manager=self.window_manager)
          self.list_view = ListWindow(tlx=15, tly=15, width=20, height=5, title='List Window', framed=True,
                                      window_manager=self.window_manager)
          self.list_view.add_item('An item.', 'An item.')
          self.list_view.add_item('Another item.', 'Uhuh.')
          self.list_view.add_item('Keep going.', 'Number.')
          self.list_view.add_item('Scrolling yet?', 'Scroll')
          self.list_view.add_item('last one', 'the end.')
          self.ipy_poll = time.monotonic()

      def print_debug_info(self):
          fps = tcod.sys_get_fps()
          root = self.window_manager.rootc
          root.write(0, 0, "Time elapsed = {0}".format(time.monotonic()))
          root.write(0, 1, "FPS = {0}".format(fps))
          if self.window_manager.topwin:
              root.write(0, 2, "Current focus = {0}.".format(self.window_manager.topwin))

      def step(self, root):
          start = time.monotonic()
          if self.current_event:
              if self.current_event.type == "QUIT" or \
                 (self.current_event.type == "KEYDOWN" and self.current_event.sym == tcod.event.K_ESCAPE):
                  self.end_game = True
          super().step(root)
          self.print_debug_info()
          end = time.monotonic()

  def start_demo():
      wm = WindowManager(80, 60)
      demo = DemoGuiGame(window_manager=wm)
      demo.initialize()
      t = Thread(target=demo.run, name="DemoGUIThread")
      t.start()
      return t, demo
#+END_SRC

#+RESULTS: 17150a98-5a72-4bbb-a10f-e74261c71c0e
:results:
:end:

*** Sparse Arrays and Spatial Trees

Define terrain features as rectangular shapes in a spatial tree.

Terrain is stored in a sparse matrix, or maybe just a series of arrays? Or an array
of structs?

Array of structs implementation:

#+BEGIN_SRC lisp
  (in-package :islands)

  (defparameter *world-terrain* nil)

  (defstruct tobj
    (elevation 0.0 :type short-float)
    (temperature 0.0 :type short-float)
    (ground-type 0.0 :type short-float)
    (ground-moistures 0.0 :type short-float)
    (foliage-type 0.0 :type short-float)
    (foliage-density 0.0 :type short-float))

  (defun add-hill (map cx cy radius max-height)
    (destructuring-bind (max-x max-y) (array-dimension map)
      (assert (and (< cx max-x)
                   (< cy max-y)))
      (let ((sx (- cx radius))
            (sy (- cy radius)))) )
    )

  (setf *world-terrain* (make-array '(100 100) :element-type 'tobj :initial-element (make-tobj)))

  (aref *world-terrain* 0 0)
#+END_SRC

#+RESULTS:
: #S(TOBJ
:    :ELEVATION 0.0
:    :TEMPERATURE 0.0
:    :GROUND-TYPE 0.0
:    :GROUND-MOISTURES 0.0
:    :FOLIAGE-TYPE 0.0
:    :FOLIAGE-DENSITY 0.0)

Or, taking advantage of tcod

#+BEGIN_SRC lisp
  (in-package :islands)

  (defstruct world
    elevations
    temperatures
    ground-types
    ground-moistures
    foliage-types
    foliage-density)

  (defun href (hm x y)
    (tcod:heightmap-get-value hm x y))

  (defun set-href (hm x y val)
    (tcod:heightmap-set-value hm x y val))

  (defsetf href (hm x y) (newval)
    `(set-href ,hm ,x ,y ,newval))

  (defun new-world (w h)
    (let ((world (make-world))
          (dims (list w h)))
      (setf (world-elevations world) (tcod:heightmap-new w h)
            (world-temperatures world) (make-array dims :element-type 'short-float :initial-element 0.0)
            (world-ground-types world) (make-array dims :element-type 'short-float :initial-element 0.0)
            (world-ground-moistures world) (make-array dims :element-type 'short-float :initial-element 0.0)
            (world-foliage-types world) (make-array dims :element-type 'short-float :initial-element 0.0)
            (world-foliage-density world) (make-array dims :element-type 'short-float :initial-element 0.0))))
#+END_SRC

#+RESULTS:
: NEW-WORLD

*** Using Graph Theory

One can see an implementation of this in [[file:c:/Users/mille/Dropbox/Projects/Islands/MapChunk.py::class%20PolygonMap(object):][MapChunk]] with the PolygonMap class. The
basic datastructure is a network. We'll see how efficient this is, but the
expressive power is considerable. Each node in the graph is a [[file:c:/Users/mille/Dropbox/Projects/Islands/MapChunk.py::class%20TerrainFeatures(object):][TerrainFeatures]]
object.

Below let's see some examples of using the class:

#+NAME: 2d43fca7-8b1f-4bdb-bf2a-a40eedde0a7d
#+BEGIN_SRC ein :session 8888 :session 8888/Islands/Islands.ipynb
  from MapChunk import PolygonMap

  map = PolygonMap()

  map[0, 0].elevation = 1.0
  map[0,0].elevation

  map.dist_map
#+END_SRC

#+RESULTS: 2d43fca7-8b1f-4bdb-bf2a-a40eedde0a7d
: ---------------------------------------------------------------------------
ModuleNotFoundError                       Traceback (most recent call last)
<ipython-input-10-b986fa6692be> in <module>()
----> 1 from MapChunk import PolygonMap
      2
      3 map = PolygonMap()
      4
      5 map[0, 0].elevation = 1.0

c:\Users\millejoh\Dropbox\Projects\Islands\MapChunk.py in <module>()
      1 import random as rand
      2 import numpy as np
----> 3 import networkx as nx
      4 import attr
      5 import esper

ModuleNotFoundError: No module named 'networkx'


#+RESULTS:
: <scipy.spatial.kdtree.KDTree at 0x2a8b2e7c3c8>

